const array = ["正月", "成人の日", "建国記念日", "天皇誕生日", "春分の日", "昭和の日", "みどりの日", "こどもの日", "海の日", "山の日", "敬老の日", "スポーツの日", "文化の日", "勤労感謝の日"];
for (const value of array) {
  console.log(value);
}

// 正月
// 成人の日
// 建国記念日
// 天皇誕生日
// 春分の日
// 昭和の日
// 憲法記念日
// みどりの日
// こどもの日
// 海の日
// 山の日
// 敬老の日
// 秋分の日
// スポーツの日
// 文化の日
// 勤労感謝の日

var arr = ["正月", "成人の日", "建国記念日", "天皇誕生日", "春分の日", "昭和の日", "みどりの日", "こどもの日", "海の日", "山の日", "敬老の日", "スポーツの日", "文化の日", "勤労感謝の日"];

var i = 0;

while(i < arr.length){
	console.log(arr[i]);
	i++;
}
